In [1]:
import sqlite3
import pandas as pd
from pandas import DataFrame

from IPython.core.display import display, HTML
display(HTML("<style>.container { width:100% !important; }</style>"))

%matplotlib inline
%config InlineBackend.figure_format='retina'

pd.set_option('display.max_rows', None)
pd.set_option('display.max_columns', None)
pd.set_option('display.width', None)

import warnings
warnings.filterwarnings('ignore')

from IPython.display import display_html
from itertools import chain,cycle
def display_side_by_side(*args,titles=cycle([''])):
    html_str=''
    for df,title in zip(args, chain(titles,cycle(['</br>'])) ):
        html_str+='<th style="text-align:center"><td style="vertical-align:top">'
        html_str+=f'<h2>{title}</h2>'
        html_str+=df.to_html().replace('table','table style="display:inline"')
        html_str+='</td></th>'
    display_html(html_str,raw=True)

## SQL Tutorial and play:

A friend asked me for a small SQL demonstration and decided to make it as a tutorial with multiple examples.

We will be using python package sqlite3 to query the SQL database.


**IMPORTANT:** always remember there is a defined order of how to compose a query:

- SELECT
- FROM
- JOIN
- WHERE
- GROUP BY
- HAVING
- ORDER BY

## Connect to SQL database:

In [2]:
conn = sqlite3.connect('Chinook_Sqlite.sqlite')  
c = conn.cursor()

## Check the tables that composed the database:

In [3]:
d = c.execute("SELECT name FROM sqlite_master WHERE type = 'table'").fetchall()
d

[('Album',),
 ('Artist',),
 ('Customer',),
 ('Employee',),
 ('Genre',),
 ('Invoice',),
 ('InvoiceLine',),
 ('MediaType',),
 ('Playlist',),
 ('PlaylistTrack',),
 ('Track',)]

## Check the structure of a table:

#### Let's check the first 3 tables, it will provide the column names and the column data type (integer, nvarchart/string, etc...):

In [4]:
for i in d[:3]:
    for row in c.execute("PRAGMA table_info({})".format(i[0])).fetchall():
        print(row)
    print(" ")

(0, 'AlbumId', 'INTEGER', 1, None, 1)
(1, 'Title', 'NVARCHAR(160)', 1, None, 0)
(2, 'ArtistId', 'INTEGER', 1, None, 0)

(0, 'ArtistId', 'INTEGER', 1, None, 1)
(1, 'Name', 'NVARCHAR(120)', 0, None, 0)

(0, 'CustomerId', 'INTEGER', 1, None, 1)
(1, 'FirstName', 'NVARCHAR(40)', 1, None, 0)
(2, 'LastName', 'NVARCHAR(20)', 1, None, 0)
(3, 'Company', 'NVARCHAR(80)', 0, None, 0)
(4, 'Address', 'NVARCHAR(70)', 0, None, 0)
(5, 'City', 'NVARCHAR(40)', 0, None, 0)
(6, 'State', 'NVARCHAR(40)', 0, None, 0)
(7, 'Country', 'NVARCHAR(40)', 0, None, 0)
(8, 'PostalCode', 'NVARCHAR(10)', 0, None, 0)
(9, 'Phone', 'NVARCHAR(24)', 0, None, 0)
(10, 'Fax', 'NVARCHAR(24)', 0, None, 0)
(11, 'Email', 'NVARCHAR(60)', 1, None, 0)
(12, 'SupportRepId', 'INTEGER', 0, None, 0)

### Structure of one table:

In [5]:
c.execute("PRAGMA table_info('Album')").fetchall()
# c.execute('SELECT * FROM Album').description

[(0, 'AlbumId', 'INTEGER', 1, None, 1),
 (1, 'Title', 'NVARCHAR(160)', 1, None, 0),
 (2, 'ArtistId', 'INTEGER', 1, None, 0)]

### Multiple ways to read a query into a dataframe, 2 of them below:

In [6]:
## Method 1:
df1 = pd.read_sql_query("SELECT * FROM Genre LIMIT 3", conn)


## Method 2:
c.execute("SELECT * FROM Genre LIMIT 3")    ## query
names = [x[0] for x in c.description]       ## extract names of columns
df2 = DataFrame(c.fetchall(),columns=names) ## create a pandas dataframe

display_side_by_side(df1,df2, titles=['Method1','Method2'])

,GenreId,Name
0,1,Rock
1,2,Jazz
2,3,Metal
,GenreId,Name
0,1,Rock
1,2,Jazz
2,3,Metal

## Fetch all the rows from a table and create a dataframe:

In [7]:
df1 = pd.read_sql_query("SELECT * FROM 'Album'",conn)
print('df1 - rows:',df1.shape[0],'columns:',df1.shape[1])

df2 = pd.read_sql_query("SELECT * FROM 'Artist'",conn)
print('df2 - rows:',df2.shape[0],'columns:',df2.shape[1])

df3 = pd.read_sql_query("SELECT * FROM 'Track'",conn)
print('df3 - rows:',df3.shape[0],'columns:',df3.shape[1])

display_side_by_side(df1.head(),df2.head(),df3.head(), titles=['Album','Artist','Track'])

df1 - rows: 347 columns: 3
df2 - rows: 275 columns: 2
df3 - rows: 3503 columns: 9

### From the table 'Album', for ArtistId '1', show me the the distinct albums name:

In [8]:
## note: for this df, it doesn't matter to put DISTINCT or not are they are already unique values...but it is good to know it.
c.execute("SELECT DISTINCT title FROM Album WHERE ArtistId = '1'").fetchall()

[('For Those About To Rock We Salute You',), ('Let There Be Rock',)]

In [9]:
info = "1",
print('Fetch one element for one artist: \n\n       {}'.format(c.execute("SELECT title from Album WHERE ArtistId == ?", info).fetchone()))

print(' ')

info = ("1","2")
print('Fetch all elements for two artist:\n\n       {}'.format(c.execute("SELECT title from Album WHERE ArtistId IN (?,?)", info).fetchall()))

# print(' ')
# info = ("1","2")
# print('Fetch all elements for two artist written in a different way:\n\n', c.execute("SELECT title from Album WHERE ArtistId IN \
#                                                                                     (" + ",".join("?"*len(info)) + ")", info).fetchall())

Fetch one element for one artist:

       ('For Those About To Rock We Salute You',)

Fetch all elements for two artist:

       [('For Those About To Rock We Salute You',), ('Let There Be Rock',), ('Balls to the Wall',), ('Restless and Wild',)]

### Look at the query below for your first JOIN of dfs:

We want to merge 3 dfs 'Artist', 'Album', 'Track' together and keep:
- the name of the Artist from the 'Artist' table
- the name of the album from the 'Album' table
- the name of the track and the composer of the track from the 'Track' table

Does the query below make sense:

In [10]:
sql='''SELECT A1.Name as ArtistName, A2.Title as AlbumName, A3.Name as TrackName, A3.Composer
        FROM Artist AS A1
        
        LEFT JOIN 
        (
            SELECT A2.ArtistId, A2.Title, A2.AlbumId
            FROM Album AS A2
        ) A2 
        ON A1.ArtistId = A2.ArtistId
        
        LEFT JOIN 
        (
            SELECT A3.AlbumId, A3.Name, A3.Composer
            FROM Track AS A3
        ) A3 
        ON A2.AlbumId = A3.AlbumId
        
        '''
df = pd.read_sql(sql, con=conn) 
print('df - rows:',df.shape[0],'columns:',df.shape[1])
df.head()

df - rows: 3574 columns: 4

,ArtistName,AlbumName,TrackName,Composer
0,AC/DC,For Those About To Rock We Salute You,For Those About To Rock (We Salute You),"Angus Young, Malcolm Young, Brian Johnson"
1,AC/DC,For Those About To Rock We Salute You,Put The Finger On You,"Angus Young, Malcolm Young, Brian Johnson"
2,AC/DC,For Those About To Rock We Salute You,Let's Get It Up,"Angus Young, Malcolm Young, Brian Johnson"
3,AC/DC,For Those About To Rock We Salute You,Inject The Venom,"Angus Young, Malcolm Young, Brian Johnson"
4,AC/DC,For Those About To Rock We Salute You,Snowballed,"Angus Young, Malcolm Young, Brian Johnson"

**REMEMBER:** There is a defined order on how to compose a query:

- SELECT
- FROM
- JOIN
- WHERE AND
- GROUPB BY
- HAVING
- ORDER BY
- LIMIT

Check the query below, we want to GROUP BY to get:
- the number of track 
- per album (group by)
- for the artist "AC/DC"
- by descending order on column TrackName (A3.Name) ASC|DESC
- and we want to get only the first 5 rows. (here only 2 anyways...)

In [11]:
sql='''SELECT A1.Name as ArtistName, A2.Title, COUNT(A3.Name) as TrackName
        FROM Artist AS A1
        
        LEFT JOIN 
        (
            SELECT A2.ArtistId, A2.Title, A2.AlbumId
            FROM Album AS A2
        ) A2 
        ON A1.ArtistId = A2.ArtistId
        
        LEFT JOIN 
        (
            SELECT A3.AlbumId, A3.Name
            FROM Track AS A3
        ) A3 
        ON A2.AlbumId = A3.AlbumId

        WHERE A1.Name == "AC/DC"
        
        GROUP BY A1.Name, A2.Title
        
        HAVING COUNT(A3.Name) > 5
        
        ORDER BY A3.Name DESC
        
        LIMIT 5
        
        '''
df = pd.read_sql(sql, con=conn) 
print('df - rows:',df.shape[0],'columns:',df.shape[1])
df

df - rows: 2 columns: 3

  ArtistName                                  Title  TrackName
0      AC/DC  For Those About To Rock We Salute You         10
1      AC/DC                      Let There Be Rock          8

### Another example of query: (easier to read ;) )

In [12]:
%%time

sql='''SELECT A1.Name, A2.Title, COUNT(A3.Name) as TrackName, A3.Composer FROM Artist AS A1
        
        LEFT JOIN (SELECT A2.ArtistId, A2.Title, A2.AlbumId FROM Album AS A2) A2 ON A1.ArtistId = A2.ArtistId
        
        LEFT JOIN (SELECT A3.AlbumId, A3.Name, A3.Composer FROM Track AS A3) A3 ON A2.AlbumId = A3.AlbumId
        
        WHERE A2.Title != "None" AND A1.Name == 'AC/DC'
        
        GROUP BY A1.Name, A2.Title
        
        HAVING COUNT(A3.Name) > 8
        
        ORDER BY A1.Name DESC
        
        '''
df = pd.read_sql(sql, con=conn) 
print('df - rows:',df.shape[0],'columns:',df.shape[1])
df.head(50)

df - rows: 1 columns: 4
CPU times: user 6.92 ms, sys: 1.07 ms, total: 7.99 ms
Wall time: 6.75 ms

,Name,Title,TrackName,Composer
0,AC/DC,For Those About To Rock We Salute You,10,"Angus Young, Malcolm Young, Brian Johnson"

### Try yourself some of these below, best to learn and assimilate!

- SUM
- COUNT
- DISTINCT COUNT
- Date time manipulation => in the table 'Invoice', column 'InvoiceDate' is datetime.
- String formatting
- Windows function
- Subqueries
- Understanding indexing
- totals
- MAX and MIN

In [13]:
sql = """
        SELECT ArtistId, COUNT( DISTINCT Title) 
        FROM ALBUM
        GROUP BY ArtistId
      """
df1 = pd.read_sql(sql, con=conn)


sql = """
        SELECT COUNT (DISTINCT Title)
        FROM ALBUM
      """
df2 = pd.read_sql(sql, con=conn)


sql = """
        SELECT GenreId, SUM(UnitPrice)
        FROM Track
        WHERE GenreId == 1 OR GenreId == '4'
        GROUP BY GenreId
      """
df3 = pd.read_sql(sql, con=conn)  


sql = """
        SELECT strftime("%Y", date(InvoiceDate))
        FROM Invoice
        GROUP BY InvoiceDate
      """
df4 = pd.read_sql(sql, con=conn)  


display_side_by_side(df1.head(),df2.head(),df3.head(),df4.head(), 
                     titles=['Count of Album per Artist','Count of Album overall',
                             'Sum of unit price per Genre','Extract year from Datetime'])

In [14]:
sql = """
        SELECT ArtistId, MAX(count)
        FROM 
            (SELECT ArtistId, COUNT (DISTINCT Title) AS count
            FROM Album
            GROUP BY ArtistId)
      """
df1 = pd.read_sql(sql, con=conn)

sql = """
        SELECT ArtistId, COUNT (DISTINCT Title) AS count
        FROM Album
        GROUP BY ArtistId
        ORDER BY count DESC
        LIMIT 3
      """
df2 = pd.read_sql(sql, con=conn)

sql = """
        SELECT ArtistId, MIN(count)
        FROM 
            (SELECT ArtistId, COUNT (DISTINCT Title) AS count
            FROM Album
            GROUP BY ArtistId)
      """
df3 = pd.read_sql(sql, con=conn)

sql = """
        SELECT ArtistId, COUNT (DISTINCT Title) AS count
        FROM Album
        GROUP BY ArtistId
        ORDER BY count ASC
        LIMIT 3
      """
df4 = pd.read_sql(sql, con=conn)

display_side_by_side(df1.head(),df2.head(), df3.head(), df4.head(),
                     titles=['Artist w Max nbr of Albums',"Artists w Max nbr of Albums (display 3)",
                             'Artist w Min nbr of Albums',"Artists w Min nbr of Albums (display 3)"])

,ArtistId,MAX(count)
0,90,21
,ArtistId,count
0,90,21
1,22,14
2,58,11
,ArtistId,MIN(count)
0,3,1
,ArtistId,count
0,3,1
1,4,1
2,5,1

### Next, we will create a database, define data types and go into more advanced and complex queries. Hope SQL makes more sense now.